espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
/***************************************************************************/ /**
 * @file
 * @brief CPC UART SECONDARY implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"
#endif
#include "em_usart.h"
#include "em_ldma.h"
#include "em_cmu.h"
#include "em_gpio.h"

#include "dmadrv.h"

#include "sl_status.h"
#include "sl_atomic.h"
#include "sl_slist.h"

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
#include "sl_power_manager.h"
#endif

#include "sli_cpc_drv.h"
#include "sli_cpc_hdlc.h"
#include "sli_cpc_debug.h"
#include "sli_cpc_crc.h"
#include "sl_cpc_config.h"
#include "sl_cpc_drv_secondary_uart_config.h"
#include "sli_cpc.h"

/*******************************************************************************
 ********************************   DATATYPE   *********************************
 ******************************************************************************/
typedef struct {
  sl_slist_node_t node;
  sl_cpc_buffer_handle_t *handle;
  uint16_t payload_len;
} sli_buf_entry_t;

/*******************************************************************************
 *********************************   DEFINES   *********************************
 ******************************************************************************/

#if ((SLI_CPC_RX_DATA_MAX_LENGTH > 2048) \
  && (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D))
#error  Buffer larger than 2048 bytes without Hardware Flow Control is not supported
#endif

#if (SL_CPC_DRV_UART_RX_QUEUE_SIZE > SL_CPC_RX_BUFFER_MAX_COUNT)
#error  Invalid configuration SL_CPC_RX_BUFFER_MAX_COUNT must be greater than SL_CPC_DRV_UART_RX_QUEUE_SIZE
#endif

#define SL_CPC_CONCAT_PASTER(first, second, third)  first ##  second ## third
#define SL_CPC_PERIPH_CLOCK(first, second)  first ##  second

#define SL_CPC_USART_CLOCK(periph)                 SL_CPC_PERIPH_CLOCK(cmuClock_USART, periph)
#define SL_CPC_RX_IRQn(periph_nbr)                 SL_CPC_CONCAT_PASTER(USART, periph_nbr, _RX_IRQn)
#define SL_CPC_TX_IRQn(periph_nbr)                 SL_CPC_CONCAT_PASTER(USART, periph_nbr, _TX_IRQn)
#define SL_CPC_ISR_RX_HANDLER(periph_nbr)          SL_CPC_CONCAT_PASTER(USART, periph_nbr, _RX_IRQHandler)
#define SL_CPC_ISR_TX_HANDLER(periph_nbr)          SL_CPC_CONCAT_PASTER(USART, periph_nbr, _TX_IRQHandler)

#define SL_CPC_LDMA_RX_PERIPH_TRIGGER(periph_nbr)   SL_CPC_CONCAT_PASTER(ldmaPeripheralSignal_USART, periph_nbr, _RXDATAV)
#define SL_CPC_LDMA_TX_PERIPH_TRIGGER(periph_nbr)   SL_CPC_CONCAT_PASTER(ldmaPeripheralSignal_USART, periph_nbr, _TXBL)

/// Maximum length of one LDMA transfer.
#define DMA_MAX_XFER_LEN (((_LDMA_CH_CTRL_XFERCNT_MASK >> _LDMA_CH_CTRL_XFERCNT_SHIFT) + 1))

#define RX_DMA_DESCRIPTOR_PER_BUF  ((SLI_CPC_RX_DATA_MAX_LENGTH + DMA_MAX_XFER_LEN - 1) / DMA_MAX_XFER_LEN)
#define RX_DMA_DESCRIPTOR_QTY      (SL_CPC_DRV_UART_RX_QUEUE_SIZE * RX_DMA_DESCRIPTOR_PER_BUF)

/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/

static unsigned int read_channel;
static unsigned int write_channel;

static LDMA_TransferCfg_t rx_config;
static LDMA_TransferCfg_t tx_config;

static LDMA_Descriptor_t rx_descriptor[RX_DMA_DESCRIPTOR_QTY];
static LDMA_Descriptor_t *rx_descriptor_head = NULL;
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
static LDMA_Descriptor_t *rx_descriptor_tail = NULL;
#endif

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
/* An extra DMA descriptor is needed for the security tag */
static LDMA_Descriptor_t tx_descriptor[5u];
#else
static LDMA_Descriptor_t tx_descriptor[4u];
#endif

static sl_slist_node_t *rx_free_list_head;
static sl_slist_node_t *rx_free_no_buf_list_head;
static sl_slist_node_t *rx_pending_list_head;

static sl_slist_node_t *tx_free_list_head;
static sl_slist_node_t *tx_submitted_list_head;

static sli_buf_entry_t rx_buf_entries_tbl[SL_CPC_DRV_UART_RX_QUEUE_SIZE];
static sli_buf_entry_t tx_buf_entries_tbl[SL_CPC_DRV_UART_TX_QUEUE_SIZE];

static sli_buf_entry_t *current_rx_entry;

static bool tx_ready = true;

static sli_mem_pool_handle_t mempool_rx_dma_desc;
static uint16_t next_rx_buf_tot_len = 0;
static bool header_expected_next = true;
static uint16_t next_rx_payload_len = 0;

static uint16_t nb_desc_free = 0u;

static uint8_t rx_synch_header[SLI_CPC_HDLC_HEADER_RAW_SIZE];
static uint16_t rx_synch_byte_cnt = 0;
static bool rx_need_desc = false;
static bool rx_need_rx_entry = false;

static volatile uint16_t already_recvd_cnt_worst = 0;

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
static bool restart_dma = false;
#endif

