espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/

//static void sli_cpc_uart_read_data_idle(void);
static sl_status_t prepare_next_tx(void);

static bool rx_dma_complete(unsigned int channel,
                            unsigned int sequenceNo,
                            void *userParam);

static void force_current_rx_dma_length(uint16_t new_length);

static sl_status_t update_current_rx_dma_length(uint16_t new_length);

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
static bool update_current_rx_dma_large_payload_length(uint16_t new_length);

static void rx_buffer_free_from_isr(void);

static void push_back_new_rx_dma_desc(LDMA_Descriptor_t *new_dma_desc,
                                      void *buffer);

static void update_dma_desc_link_abs(LDMA_Descriptor_t *current_dma_desc,
                                     LDMA_Descriptor_t *next_dma_desc);
#endif

static void notify_core_error(sl_cpc_reject_reason_t reason);

static void start_re_synch(void);

/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************/ /**
 * Initiate UART Hardware.
 ******************************************************************************/
sl_status_t sli_cpc_drv_init(void)
{
  uint32_t buf_cnt;
  Ecode_t ecode;
  USART_InitAsync_TypeDef init = USART_INITASYNC_DEFAULT;
  uint32_t dma_desc_cnt = 0;
  LDMA_Descriptor_t *current_desc;
  LDMA_Descriptor_t *previous_desc = NULL;
  void *buffer_ptr;

  // Enable peripheral clocks
#if defined(_CMU_HFPERCLKEN0_MASK)
  CMU_ClockEnable(cmuClock_HFPER, true);
#endif

  CMU_ClockEnable(cmuClock_GPIO, true);
  CMU_ClockEnable(SL_CPC_USART_CLOCK(SL_CPC_DRV_UART_PERIPHERAL_NO), true);

  NVIC_EnableIRQ(SL_CPC_TX_IRQn(SL_CPC_DRV_UART_PERIPHERAL_NO));
  NVIC_EnableIRQ(SL_CPC_RX_IRQn(SL_CPC_DRV_UART_PERIPHERAL_NO));

  sl_slist_init(&rx_free_list_head);
  sl_slist_init(&rx_free_no_buf_list_head);
  sl_slist_init(&rx_pending_list_head);
  sl_slist_init(&tx_free_list_head);
  sl_slist_init(&tx_submitted_list_head);

  current_rx_entry = NULL;

  for (buf_cnt = 0; buf_cnt < SL_CPC_DRV_UART_RX_QUEUE_SIZE; buf_cnt++) {
    sli_buf_entry_t *entry = &rx_buf_entries_tbl[buf_cnt];
    EFM_ASSERT(sli_cpc_get_buffer_handle_for_rx(&entry->handle) == SL_STATUS_OK);
    sli_cpc_push_buffer_handle(&rx_free_list_head, &entry->node, entry->handle);
  }

  for (buf_cnt = 0; buf_cnt < SL_CPC_DRV_UART_TX_QUEUE_SIZE; buf_cnt++) {
    sli_buf_entry_t *entry = &tx_buf_entries_tbl[buf_cnt];
    sl_slist_push(&tx_free_list_head, &entry->node);
  }

  // Configure TX and RX GPIOs
  GPIO_PinModeSet(SL_CPC_DRV_UART_TX_PORT, SL_CPC_DRV_UART_TX_PIN, gpioModePushPull, 1);
  GPIO_PinModeSet(SL_CPC_DRV_UART_RX_PORT, SL_CPC_DRV_UART_RX_PIN, gpioModeInputPull, 1);

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
  init.hwFlowControl = usartHwFlowControlNone;
#elif (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
  init.hwFlowControl = usartHwFlowControlCtsAndRts;
#endif

  init.baudrate = SL_CPC_DRV_UART_BAUDRATE;
  init.enable = usartDisable;

  // Initialize an UART driver instance.
  USART_InitAsync(SL_CPC_DRV_UART_PERIPHERAL, &init);

#if defined(USART_ROUTEPEN_TXPEN)
  SL_CPC_DRV_UART_PERIPHERAL->ROUTELOC0 = (SL_CPC_DRV_UART_PERIPHERAL->ROUTELOC0
                                           & ~(_USART_ROUTELOC0_TXLOC_MASK
                                               | _USART_ROUTELOC0_RXLOC_MASK))
                                          | (SL_CPC_DRV_UART_TX_LOC
                                             << _USART_ROUTELOC0_TXLOC_SHIFT)
                                          | (SL_CPC_DRV_UART_RX_LOC
                                             << _USART_ROUTELOC0_RXLOC_SHIFT);

  SL_CPC_DRV_UART_PERIPHERAL->ROUTEPEN = USART_ROUTEPEN_TXPEN
                                         | USART_ROUTEPEN_RXPEN;
#elif defined(USART_ROUTE_TXPEN)
  SL_CPC_DRV_UART_PERIPHERAL->ROUTE = USART_ROUTE_TXPEN
                                      | USART_ROUTE_RXPEN
                                      | (SL_CPC_DRV_UART_RX_LOC
                                         << _USART_ROUTE_LOCATION_SHIFT);
#elif defined(GPIO_USART_ROUTEEN_TXPEN)
  GPIO->USARTROUTE[SL_CPC_DRV_UART_PERIPHERAL_NO].ROUTEEN = GPIO_USART_ROUTEEN_TXPEN
                                                            | GPIO_USART_ROUTEEN_RXPEN;
  GPIO->USARTROUTE[SL_CPC_DRV_UART_PERIPHERAL_NO].TXROUTE =
    (SL_CPC_DRV_UART_TX_PORT << _GPIO_USART_TXROUTE_PORT_SHIFT)
    | (SL_CPC_DRV_UART_TX_PIN << _GPIO_USART_TXROUTE_PIN_SHIFT);
  GPIO->USARTROUTE[SL_CPC_DRV_UART_PERIPHERAL_NO].RXROUTE =
    (SL_CPC_DRV_UART_RX_PORT << _GPIO_USART_RXROUTE_PORT_SHIFT)
    | (SL_CPC_DRV_UART_RX_PIN << _GPIO_USART_RXROUTE_PIN_SHIFT);
#endif

  if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D) {
    GPIO_PinModeSet(SL_CPC_DRV_UART_CTS_PORT, SL_CPC_DRV_UART_CTS_PIN, gpioModeInputPull, 0);

#if defined(_USART_ROUTEPEN_RTSPEN_MASK) && defined(_USART_ROUTEPEN_CTSPEN_MASK)
    SL_CPC_DRV_UART_PERIPHERAL->ROUTELOC1 = (SL_CPC_DRV_UART_CTS_LOC << _USART_ROUTELOC1_CTSLOC_SHIFT);
    SL_CPC_DRV_UART_PERIPHERAL->CTRLX    |= USART_CTRLX_CTSEN;
    SL_CPC_DRV_UART_PERIPHERAL->ROUTEPEN |= USART_ROUTEPEN_CTSPEN;
#elif defined(_GPIO_USART_ROUTEEN_MASK)
    GPIO->USARTROUTE_SET[SL_CPC_DRV_UART_PERIPHERAL_NO].CTSROUTE = (SL_CPC_DRV_UART_CTS_PORT << _GPIO_USART_CTSROUTE_PORT_SHIFT)
                                                                   | (SL_CPC_DRV_UART_CTS_PIN << _GPIO_USART_CTSROUTE_PIN_SHIFT);
    SL_CPC_DRV_UART_PERIPHERAL->CTRLX_SET = USART_CTRLX_CTSEN;
#endif

