espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
    GPIO_PinModeSet(SL_CPC_DRV_UART_RTS_PORT, SL_CPC_DRV_UART_RTS_PIN, gpioModePushPull, 0);

#if defined(_USART_ROUTEPEN_RTSPEN_MASK) && defined(_USART_ROUTEPEN_CTSPEN_MASK)
    SL_CPC_DRV_UART_PERIPHERAL->ROUTELOC1 |= (SL_CPC_DRV_UART_RTS_LOC << _USART_ROUTELOC1_RTSLOC_SHIFT);
    SL_CPC_DRV_UART_PERIPHERAL->ROUTEPEN |= USART_ROUTEPEN_RTSPEN;

#elif defined(_GPIO_USART_ROUTEEN_MASK)
    GPIO->USARTROUTE_SET[SL_CPC_DRV_UART_PERIPHERAL_NO].ROUTEEN = GPIO_USART_ROUTEEN_RTSPEN;
    GPIO->USARTROUTE_SET[SL_CPC_DRV_UART_PERIPHERAL_NO].RTSROUTE = (SL_CPC_DRV_UART_RTS_PORT << _GPIO_USART_RTSROUTE_PORT_SHIFT)
                                                                   | (SL_CPC_DRV_UART_RTS_PIN << _GPIO_USART_RTSROUTE_PIN_SHIFT);
#endif
  }

  // Enabled TX complete interrupt
  USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_TXC);

  USART_IntClear(SL_CPC_DRV_UART_PERIPHERAL, 0xFFFFFFFF);

  // Discard false frames and/or IRQs
  SL_CPC_DRV_UART_PERIPHERAL->CMD = USART_CMD_CLEARRX | USART_CMD_CLEARTX;

  USART_Enable(SL_CPC_DRV_UART_PERIPHERAL, usartEnable);

  // Init DMA
  DMADRV_Init();

  // Allocate read and write channel
  ecode = DMADRV_AllocateChannel(&read_channel, NULL);
  EFM_ASSERT(ecode == ECODE_OK);
  ecode = DMADRV_AllocateChannel(&write_channel, NULL);
  EFM_ASSERT(ecode == ECODE_OK);

  // Configure DMA transfer
  rx_config = (LDMA_TransferCfg_t)LDMA_TRANSFER_CFG_PERIPHERAL(SL_CPC_LDMA_RX_PERIPH_TRIGGER(SL_CPC_DRV_UART_PERIPHERAL_NO));
  tx_config = (LDMA_TransferCfg_t)LDMA_TRANSFER_CFG_PERIPHERAL(SL_CPC_LDMA_TX_PERIPH_TRIGGER(SL_CPC_DRV_UART_PERIPHERAL_NO));

  sli_mem_pool_create(&mempool_rx_dma_desc,
                      sizeof(LDMA_Descriptor_t),
                      RX_DMA_DESCRIPTOR_QTY,
                      rx_descriptor,
                      sizeof(rx_descriptor));

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
  (void)dma_desc_cnt;
  (void)previous_desc;
  (void)nb_desc_free;

  sl_status_t status;

  status = sli_cpc_get_raw_rx_buffer(&buffer_ptr);
  EFM_ASSERT(status == SL_STATUS_OK);

  current_desc = (LDMA_Descriptor_t *)sli_mem_pool_alloc(&mempool_rx_dma_desc);
  *current_desc = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), buffer_ptr, (SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN);
#else
  // Prime rx dma channel will all available descriptors.
  while (dma_desc_cnt < RX_DMA_DESCRIPTOR_QTY) {
    sl_status_t status;

    status = sli_cpc_get_raw_rx_buffer(&buffer_ptr);
    EFM_ASSERT(status == SL_STATUS_OK);

    current_desc = (LDMA_Descriptor_t *)sli_mem_pool_alloc(&mempool_rx_dma_desc);
    *current_desc = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), buffer_ptr, (SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN);

    if (dma_desc_cnt == 0) {
      rx_descriptor_tail = current_desc;
    }

    if (previous_desc) {
      update_dma_desc_link_abs(current_desc, previous_desc);
    }

    dma_desc_cnt++;
    previous_desc = current_desc;
  }
#endif

  current_desc->xfer.xferCnt = SLI_CPC_HDLC_HEADER_RAW_SIZE - 1u;
  next_rx_buf_tot_len = SLI_CPC_HDLC_HEADER_RAW_SIZE;
  header_expected_next = true;

  rx_descriptor_head = current_desc;

  // Start read channel
  ecode = DMADRV_LdmaStartTransfer(read_channel,
                                   &rx_config,
                                   current_desc,
                                   rx_dma_complete,
                                   0);
  EFM_ASSERT(ecode == ECODE_OK);

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
  sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM1);
#endif

  return SL_STATUS_OK;
}

/***************************************************************************/ /**
 * Gets CPC driver capabilities.
 ******************************************************************************/
void sli_cpc_drv_get_capabilities(sli_cpc_drv_capabilities_t *capabilities)
{
  if (capabilities == NULL) {
    return;
  }

  *capabilities = (sli_cpc_drv_capabilities_t){0 };
  capabilities->preprocess_hdlc_header = true;
  capabilities->use_raw_rx_buffer = true;
  capabilities->uart_flowcontrol = SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D;
}

/***************************************************************************/ /**
 * Read bytes from UART.
 ******************************************************************************/
sl_status_t sli_cpc_drv_read_data(sl_cpc_buffer_handle_t **buffer_handle, uint16_t *payload_rx_len)
{
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  sli_buf_entry_t *entry = (sli_buf_entry_t *)SLI_CPC_POP_BUFFER_HANDLE_LIST(&rx_pending_list_head, sli_buf_entry_t);
  if (entry == NULL) {
    CORE_EXIT_ATOMIC();
    return SL_STATUS_EMPTY;
  }
  CORE_EXIT_ATOMIC();

  *buffer_handle = entry->handle;
  *payload_rx_len = SLI_CPC_RX_DATA_MAX_LENGTH;

  CORE_ENTER_ATOMIC();
  status = sli_cpc_get_buffer_handle_for_rx(&entry->handle);
  if (status == SL_STATUS_OK) {
    sli_cpc_push_buffer_handle(&rx_free_list_head, &entry->node, entry->handle);
    if (rx_need_rx_entry) {
      rx_need_rx_entry = false;
      USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);
    }
  } else {
    sl_slist_push(&rx_free_no_buf_list_head, &entry->node);
  }
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}

/***************************************************************************/ /**
 * Write bytes to UART.
 ******************************************************************************/
sl_status_t sli_cpc_drv_transmit_data(sl_cpc_buffer_handle_t *buffer_handle, uint16_t payload_tx_len)
{
  sl_status_t status;
  sli_buf_entry_t *entry;
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  entry = (sli_buf_entry_t *)sl_slist_pop(&tx_free_list_head);
  CORE_EXIT_ATOMIC();

  if (entry == NULL) {
    return SL_STATUS_NOT_READY;
  }

  entry->handle = buffer_handle;
  entry->payload_len = payload_tx_len;

