espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
  CORE_ENTER_ATOMIC();
  sli_cpc_push_back_buffer_handle(&tx_submitted_list_head, &entry->node, entry->handle);

  status = prepare_next_tx();
  if (status == SL_STATUS_RECEIVE) {
    status = SL_STATUS_OK;
  }
  CORE_EXIT_ATOMIC();

  return status;
}

/***************************************************************************/ /**
 * Checks if driver is ready to transmit.
 ******************************************************************************/
bool sli_cpc_drv_is_transmit_ready(void)
{
  sl_slist_node_t *head;
  bool flag;

  sl_atomic_load(flag, tx_ready);
  sl_atomic_load(head, tx_free_list_head);

  return (head != NULL
          && flag);
}

/***************************************************************************/ /**
 * Prepare for transmission of next buffer.
 ******************************************************************************/
static sl_status_t prepare_next_tx(void)
{
  sli_buf_entry_t *entry;
  Ecode_t code;
  uint8_t idx = 0;
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  entry = (sli_buf_entry_t *)tx_submitted_list_head;
  if (entry == NULL) {
    CORE_EXIT_ATOMIC();
    return SL_STATUS_EMPTY;
  }

  if (entry->payload_len > 0u) {
    /* First TX descriptor is for the header */
    tx_descriptor[idx++] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_M2P_BYTE(
      entry->handle->hdlc_header,
      &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
      SLI_CPC_HDLC_HEADER_RAW_SIZE,
      1u);

    /* next descriptor(s) are for the payload */
    if (entry->payload_len <= DMADRV_MAX_XFER_COUNT) {
      tx_descriptor[idx++] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_M2P_BYTE(
        entry->handle->data,
        &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
        entry->payload_len,
        1u);
    } else if (entry->payload_len <= (DMADRV_MAX_XFER_COUNT * 2)) {
      tx_descriptor[idx++] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_M2P_BYTE(
        entry->handle->data,
        &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
        DMADRV_MAX_XFER_COUNT,
        1u);
      tx_descriptor[idx++] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_M2P_BYTE(
        &((uint8_t *)entry->handle->data)[DMADRV_MAX_XFER_COUNT],
        &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
        (entry->payload_len - DMADRV_MAX_XFER_COUNT),
        1u);
    } else {
      CORE_EXIT_ATOMIC();
      return SL_STATUS_INVALID_PARAMETER;
    }

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
    /*
     * If the security is enabled and there is a security tag to send, send it
     * before the FCS.
     */
    if (entry->handle->security_tag) {
      tx_descriptor[idx++] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_M2P_BYTE(
        (uint8_t *)entry->handle->security_tag,
        &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
        SLI_SECURITY_TAG_LENGTH_BYTES,
        1u);
    }
#endif

    /* Caution: last descriptor, don't increment idx */
    tx_descriptor[idx] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_M2P_BYTE(
      entry->handle->fcs,
      &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
      2u);
  } else {
    /*
     * This buffer has no payload, header only.
     * Caution: last descriptor, don't increment idx
     */
    tx_descriptor[idx] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_M2P_BYTE(
      entry->handle->hdlc_header,
      &(SL_CPC_DRV_UART_PERIPHERAL->TXDATA),
      SLI_CPC_HDLC_HEADER_RAW_SIZE);
  }

  /* Set doneIfs only on the last used descriptor */
  tx_descriptor[idx].xfer.doneIfs = 1u;
  for (uint8_t doneIfIndex = 0; doneIfIndex < idx; doneIfIndex++) {
    tx_descriptor[doneIfIndex].xfer.doneIfs = 0u;
  }

  tx_ready = false;

  code = DMADRV_LdmaStartTransfer(write_channel,
                                  &tx_config,
                                  tx_descriptor,
                                  NULL,
                                  NULL);
  EFM_ASSERT(code == ECODE_OK);

  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}

/***************************************************************************/ /**
 * Notification when RX buffer becomes free.
 ******************************************************************************/
void sli_cpc_memory_on_rx_buffer_free(void)
{
  sl_status_t status;
  bool resource_allocation_flag = false;
  void *buffer_ptr = NULL;
  LDMA_Descriptor_t *current_desc = NULL;
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  do {
    if (rx_free_no_buf_list_head == NULL) {
      break;
    }

    sli_buf_entry_t *entry = (sli_buf_entry_t *)rx_free_no_buf_list_head;

    status = sli_cpc_get_buffer_handle_for_rx(&entry->handle);
    if (status == SL_STATUS_OK) {
      (void)sl_slist_pop(&rx_free_no_buf_list_head);
      sli_cpc_push_buffer_handle(&rx_free_list_head, &entry->node, entry->handle);
    }
  } while (status == SL_STATUS_OK && rx_free_no_buf_list_head != NULL);

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
  do {
    current_desc = (LDMA_Descriptor_t *)sli_mem_pool_alloc(&mempool_rx_dma_desc);
    if (current_desc == NULL) {
      break;
    }

    status = sli_cpc_get_raw_rx_buffer(&buffer_ptr);
    if (status != SL_STATUS_OK) {
      sli_mem_pool_free(&mempool_rx_dma_desc, (void *)current_desc);
      break;
    }

    resource_allocation_flag = true;

    push_back_new_rx_dma_desc(current_desc, buffer_ptr);
  } while (true);

  // Start re-synch, if we ran out of DMA descriptor earlier,
  // a descriptor is available to be used and the DMA has been stopped.
  if (rx_need_desc
      && (LDMA->CHEN & (1 << read_channel)) == 0
      && resource_allocation_flag) {
    rx_need_desc = false;
    USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);
  }
#else
  bool dma;
  sl_atomic_load(dma, restart_dma);
  if (dma) {
    (void)update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
  }

  (void)resource_allocation_flag;
  (void)buffer_ptr;
  (void)current_desc;
#endif

  CORE_EXIT_ATOMIC();
}

/***************************************************************************//**
 * RX IRQ handler.
 ******************************************************************************/
void SL_CPC_ISR_RX_HANDLER(SL_CPC_DRV_UART_PERIPHERAL_NO)(void)
{
  uint32_t flag = USART_IntGet(SL_CPC_DRV_UART_PERIPHERAL);

  USART_IntClear(SL_CPC_DRV_UART_PERIPHERAL, flag & USART_IF_RXDATAV);

  if (flag & USART_IF_RXDATAV) {
    EFM_ASSERT(header_expected_next == true); // Can't resync when waiting for a payload

    uint8_t data = SL_CPC_DRV_UART_PERIPHERAL->RXDATA;

    if (((rx_synch_byte_cnt < SLI_CPC_HDLC_HEADER_RAW_SIZE)
         && (rx_synch_byte_cnt > 0))
        || (data == SLI_CPC_HDLC_FLAG_VAL)) {
      rx_synch_header[rx_synch_byte_cnt++] = data;
    }

    if (rx_synch_byte_cnt == SLI_CPC_HDLC_HEADER_RAW_SIZE) {
      // Validate HCS
      uint16_t hcs = sli_cpc_hdlc_get_hcs(rx_synch_header);
      if (!sli_cpc_validate_crc_sw(rx_synch_header, SLI_CPC_HDLC_HEADER_SIZE, hcs)) {
        uint8_t i;
        bool valid_byte = false;
        for (i = 1; i < SLI_CPC_HDLC_HEADER_RAW_SIZE; i++) {
          if (rx_synch_header[i] == SLI_CPC_HDLC_FLAG_VAL) {
            memmove(&rx_synch_header[0], &rx_synch_header[i], SLI_CPC_HDLC_HEADER_RAW_SIZE - i);
            valid_byte = true;
            break;
          }
        }

        if (valid_byte) {
          rx_synch_byte_cnt = SLI_CPC_HDLC_HEADER_RAW_SIZE - i;
        } else {
          rx_synch_byte_cnt = 0;
        }

        return;
      }

      rx_synch_byte_cnt = 0;

