espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
      USART_IntDisable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);

      uint16_t payload_len = sli_cpc_hdlc_get_length(rx_synch_header);

      if (payload_len > 0) {
        header_expected_next = false;
      }

      if (current_rx_entry == NULL) {
        current_rx_entry = (sli_buf_entry_t *)SLI_CPC_POP_BUFFER_HANDLE_LIST(&rx_free_list_head, sli_buf_entry_t);
        if (current_rx_entry == NULL) {
          rx_need_rx_entry = true;
          return;
          // Need to wait for a available buffer and re-synch
        }
      }

      force_current_rx_dma_length(header_expected_next ? SLI_CPC_HDLC_HEADER_RAW_SIZE : payload_len);

      // Copy useful fields of header. Unfortunately with this method the header must always be copied
      memcpy(current_rx_entry->handle->hdlc_header, rx_synch_header, SLI_CPC_HDLC_HEADER_RAW_SIZE);
      current_rx_entry->handle->data_length = payload_len;

      next_rx_payload_len = payload_len;

      if (payload_len == 0) {
        // Push rx_entry to pending list
        sli_cpc_push_back_buffer_handle(&rx_pending_list_head, &current_rx_entry->node, current_rx_entry->handle);
        // Notify core
        sli_cpc_drv_notify_rx_data();
      }
    }
  }
}

/***************************************************************************//**
 * TX IRQ handler.
 ******************************************************************************/
void SL_CPC_ISR_TX_HANDLER(SL_CPC_DRV_UART_PERIPHERAL_NO)(void)
{
  CORE_DECLARE_IRQ_STATE;

  uint32_t flag = USART_IntGet(SL_CPC_DRV_UART_PERIPHERAL);

  USART_IntClear(SL_CPC_DRV_UART_PERIPHERAL, flag & USART_IF_TXC);

  if (flag & USART_IF_TXC) {
    DMADRV_StopTransfer(write_channel);

    tx_ready = true;

    sli_buf_entry_t *entry;

    CORE_ENTER_ATOMIC();
    entry = (sli_buf_entry_t *)SLI_CPC_POP_BUFFER_HANDLE_LIST(&tx_submitted_list_head, sli_buf_entry_t);
    CORE_EXIT_ATOMIC();

    // Notify core
    sli_cpc_drv_notify_tx_complete(entry->handle);

    CORE_ENTER_ATOMIC();
    sl_slist_push(&tx_free_list_head, &entry->node);

    if (tx_submitted_list_head) {
      (void)prepare_next_tx();
    }

    CORE_EXIT_ATOMIC();
  }
}

/***************************************************************************/ /**
 * Rx DMA xfer completed. Need to determine what was received and update the
 * XferCnt of the current DMA xfer ASAP.
 ******************************************************************************/
static bool rx_dma_complete(unsigned int channel,
                            unsigned int sequenceNo,
                            void *userParam)
{
  sl_status_t update_success = SL_STATUS_FAIL;
  LDMA_Descriptor_t *completed_desc = NULL;
  uint8_t *rx_buffer;
  uint16_t current_rx_buffer_offset;
  uint16_t current_rx_buf_tot_len;
  bool rx_buf_free = true;
  bool manually_reload_dma = false;

  (void)channel;
  (void)sequenceNo;
  (void)userParam;

  do {
    update_success = SL_STATUS_FAIL;

    completed_desc = rx_descriptor_head;
    EFM_ASSERT(completed_desc != NULL);

    rx_buffer = (uint8_t *)(completed_desc->xfer.dstAddr);

    // Load the next DMA descriptor, specified in the LINK register
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
    rx_descriptor_head = (LDMA_Descriptor_t *)(uint32_t)(rx_descriptor_head->xfer.linkAddr << _LDMA_CH_LINK_LINKADDR_SHIFT);
#endif

    if (rx_descriptor_head == NULL) {
      rx_need_desc = true;
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
      rx_descriptor_tail = NULL;
#endif
    }

    current_rx_buf_tot_len = next_rx_buf_tot_len;
    current_rx_buffer_offset = 0;

    while (current_rx_buf_tot_len > 0) {
      uint8_t *current_rx_buffer = &rx_buffer[current_rx_buffer_offset];

      if (header_expected_next) {
        uint16_t hcs;

        EFM_ASSERT(current_rx_buf_tot_len >= SLI_CPC_HDLC_HEADER_RAW_SIZE);
        current_rx_buf_tot_len -= SLI_CPC_HDLC_HEADER_RAW_SIZE;
        current_rx_entry = (sli_buf_entry_t *)SLI_CPC_POP_BUFFER_HANDLE_LIST(&rx_free_list_head, sli_buf_entry_t);
        if (current_rx_entry == NULL) {
          rx_need_rx_entry = true;
          DMADRV_StopTransfer(read_channel);
          return false;
        }

        // Validate HCS
        hcs = sli_cpc_hdlc_get_hcs(current_rx_buffer);
        if (!sli_cpc_validate_crc_sw(current_rx_buffer, SLI_CPC_HDLC_HEADER_SIZE, hcs)) {
          DMADRV_StopTransfer(read_channel);

          uint32_t dest = LDMA->CH[read_channel].DST;
          // Rewind the DMA destination to discard previously received bytes
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
          uint16_t already_recvd_cnt;
          uint32_t ctrl;

          ctrl = LDMA->CH[read_channel].CTRL;
          already_recvd_cnt = (((SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN) - 1) - ((ctrl & _LDMA_CH_CTRL_XFERCNT_MASK) >> _LDMA_CH_CTRL_XFERCNT_SHIFT);
          LDMA->CH[read_channel].DST = (dest - already_recvd_cnt);
#else
          LDMA->CH[read_channel].DST = (dest - SLI_CPC_HDLC_HEADER_RAW_SIZE);
#endif
          // No need to reload the DMA
          manually_reload_dma = false;

          USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);
          SLI_CPC_DEBUG_TRACE_CORE_DRIVER_PACKET_DROPPED();
          SLI_CPC_DEBUG_TRACE_CORE_INVALID_HEADER_CHECKSUM();
          break;
        }

        next_rx_payload_len = sli_cpc_hdlc_get_length(current_rx_buffer);

        if (rx_need_desc
            && next_rx_payload_len > 0) {
          DMADRV_StopTransfer(read_channel);

          rx_descriptor_head = completed_desc;
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
          rx_descriptor_tail = completed_desc;
#endif

          // Rewind rx buffer to re-use it
          uint32_t dest = LDMA->CH[read_channel].DST;
          LDMA->CH[read_channel].DST = (dest - SLI_CPC_HDLC_HEADER_RAW_SIZE);

          USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);
          return false;
        }

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
        if (next_rx_payload_len > 0) {
          (void)update_current_rx_dma_length(next_rx_payload_len);
        } else {
          (void)update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
        }
        (void)rx_buf_free;
#else
        if (current_rx_buf_tot_len == 0) {
          if ((next_rx_payload_len > 0)
              && (next_rx_payload_len <= DMA_MAX_XFER_LEN)) {
            update_success = update_current_rx_dma_length(next_rx_payload_len);
            if (update_success == SL_STATUS_FAIL) {
              // If we fall here, it's because we received more than the expected payload.
              // In that case, we need to re-synch on the next valid header.
              update_success = update_current_rx_dma_length(next_rx_payload_len + SLI_CPC_HDLC_HEADER_RAW_SIZE);
              if (update_success == SL_STATUS_FAIL) {
                start_re_synch();
                return false;
              } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
                DMADRV_StopTransfer(read_channel);
                // Now that the DMA is stopped, re-check the condition where the amount of bytes received is already what we requested.
                update_success = update_current_rx_dma_length(next_rx_payload_len + SLI_CPC_HDLC_HEADER_RAW_SIZE);
                if (update_success == SL_STATUS_FAIL) {
                  start_re_synch();
                  return false;
                } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
                  next_rx_buf_tot_len = next_rx_payload_len + SLI_CPC_HDLC_HEADER_RAW_SIZE;
                } else {
                  EFM_ASSERT(0);
                }
              }
            } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
              DMADRV_StopTransfer(read_channel);
              // Now that the DMA is stopped, re-check the condition where the amount of bytes received is already what we requested.
              update_success = update_current_rx_dma_length(next_rx_payload_len);
              if (update_success == SL_STATUS_FAIL) {
                start_re_synch();
                return false;
              } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
                next_rx_buf_tot_len = next_rx_payload_len;
              } else {
                EFM_ASSERT(0);
              }
            }
          } else if ((next_rx_payload_len > 0)
                     && (next_rx_payload_len > DMA_MAX_XFER_LEN)
                     && (next_rx_payload_len <= SLI_CPC_RX_DATA_MAX_LENGTH)) {
            update_success = update_current_rx_dma_large_payload_length(next_rx_payload_len);
            if (update_success == SL_STATUS_FAIL) {
              start_re_synch();
              return false;
            } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
              DMADRV_StopTransfer(read_channel);
              // Now that the DMA is stopped, re-check the condition where the amount of bytes received is already what we requested.
              update_success = update_current_rx_dma_length(next_rx_payload_len);
              if (update_success == SL_STATUS_FAIL) {
                start_re_synch();
                return false;
              } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
                next_rx_buf_tot_len = next_rx_payload_len;
              } else {
                EFM_ASSERT(0);
              }
            }
          } else if (!rx_need_desc) {
            update_success = update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
            if (update_success == SL_STATUS_FAIL) {
              start_re_synch();
              return false;
            } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
              DMADRV_StopTransfer(read_channel);
              // Now that the DMA is stopped, re-check the condition where the amount of bytes received is already what we requested.
              update_success = update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
              if (update_success == SL_STATUS_FAIL) {
                start_re_synch();
                return false;
              } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
                next_rx_buf_tot_len = SLI_CPC_HDLC_HEADER_RAW_SIZE;
              } else {
                EFM_ASSERT(0);
              }
            }
          } else {
            EFM_ASSERT(0); // Not handled;
          }
        }
#endif

        // Copy useful fields of header. Unfortunately with this method the header must always be copied
        memcpy(current_rx_entry->handle->hdlc_header, current_rx_buffer, SLI_CPC_HDLC_HEADER_RAW_SIZE);
        current_rx_entry->handle->data_length = next_rx_payload_len;

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
        sli_cpc_free_raw_rx_buffer(current_rx_buffer);
#endif

        if (next_rx_payload_len > SLI_CPC_RX_DATA_MAX_LENGTH) {
          SLI_CPC_DEBUG_TRACE_CORE_DRIVER_PACKET_DROPPED();
          notify_core_error(SL_CPC_REJECT_ERROR);
          current_rx_entry = NULL;
        } else if (next_rx_payload_len == 0) { // A header is expected next
          // Push rx_entry to pending list
          sli_cpc_push_back_buffer_handle(&rx_pending_list_head, &current_rx_entry->node, current_rx_entry->handle);

          // Notify core
          sli_cpc_drv_notify_rx_data();

          current_rx_entry = NULL;
        } else { // A payload is expected next
          header_expected_next = false;
        }

        current_rx_buffer_offset += SLI_CPC_HDLC_HEADER_RAW_SIZE;
      } else {
        current_rx_buf_tot_len -= next_rx_payload_len;

        if (manually_reload_dma) {
          next_rx_buf_tot_len = SLI_CPC_HDLC_HEADER_RAW_SIZE;
        } else if (current_rx_buf_tot_len == 0 && !rx_need_desc) {
          update_success = update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
          if (update_success == SL_STATUS_FAIL) {
            start_re_synch();
            return false;
          } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
            DMADRV_StopTransfer(read_channel);
            // Now that the DMA is stopped, re-check the condition where the amount of bytes received is already what we requested.
            update_success = update_current_rx_dma_length(SLI_CPC_HDLC_HEADER_RAW_SIZE);
            if (update_success == SL_STATUS_FAIL) {
              start_re_synch();
              return false;
            } else if (update_success == SL_STATUS_ALREADY_EXISTS) {
              next_rx_buf_tot_len = SLI_CPC_HDLC_HEADER_RAW_SIZE;
            } else {
              EFM_ASSERT(0);
            }
          }
        } else {
          EFM_ASSERT(0); // Not handled
        }

        // Add to current rx handle
        EFM_ASSERT(current_rx_entry != NULL);

        if (current_rx_buffer_offset) {
          // With the current implementation limitations, we should never get here.
          memmove(rx_buffer, current_rx_buffer, next_rx_payload_len);
        }

