espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
        current_rx_entry->handle->data = rx_buffer;
        current_rx_entry->handle->data_length = next_rx_payload_len;

        // A header is expected next
        header_expected_next = true;

        // Notify core
        sli_cpc_push_back_buffer_handle(&rx_pending_list_head, &current_rx_entry->node, current_rx_entry->handle);
        sli_cpc_drv_notify_rx_data();

        current_rx_buffer_offset += next_rx_payload_len;

        // If we ended here, it means the rx_buffer was pushed to the app.
        rx_buf_free = false;
        next_rx_payload_len = 0;
      }

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
      if (rx_buf_free) {
        // We end up in that case when we received a header with no payload. Since the buffer has not
        // been pushed to the core, we can re-use it right away.

        push_back_new_rx_dma_desc(completed_desc, rx_buffer);
      } else {
        LDMA_Descriptor_t *desc = (LDMA_Descriptor_t *)(completed_desc->xfer.linkAddr << _LDMA_CH_LINK_LINKADDR_SHIFT);
        sli_mem_pool_free(&mempool_rx_dma_desc, (void *)completed_desc);
        completed_desc = NULL;

        for (uint16_t i = 1u; i < nb_desc_free; i++) {
          LDMA_Descriptor_t *temp_desc = desc;
          sli_mem_pool_free(&mempool_rx_dma_desc, (void *)desc);
          desc = (LDMA_Descriptor_t *)(temp_desc->xfer.linkAddr << _LDMA_CH_LINK_LINKADDR_SHIFT);
          rx_descriptor_head = desc;
        }

        nb_desc_free = 0u;

        rx_buffer_free_from_isr();
      }

#endif
    }

    if (update_success == SL_STATUS_ALREADY_EXISTS) {
      manually_reload_dma = true;
    }
  } while (update_success == SL_STATUS_ALREADY_EXISTS);

  if (manually_reload_dma) {
    bool active;
    Ecode_t ecode;

    DMADRV_TransferActive(read_channel, &active);

    EFM_ASSERT(active == false);
    EFM_ASSERT(rx_need_desc == false);
    EFM_ASSERT(rx_descriptor_head != NULL);
    EFM_ASSERT(next_rx_buf_tot_len > 1u);

    rx_descriptor_head->xfer.xferCnt = next_rx_buf_tot_len - 1u;

    LDMA->IEN |= (1 << read_channel);
    LDMA->CHEN |= (1 << read_channel);

    // Start read channel
    ecode = DMADRV_LdmaStartTransfer(read_channel,
                                     &rx_config,
                                     rx_descriptor_head,
                                     rx_dma_complete,
                                     0);
    EFM_ASSERT(ecode == ECODE_OK);
  }
  return false;
}

/***************************************************************************/ /**
 * Force a new XferCnt of the current DMA xfer with the length passed as argument.
 * This function also restart the DMA transfer.
 *
 * @param new_length Total length of next transfer.
 *
 * @return true if new length successfully applied.
 *         false if the DMA already transferred more than requested.
 ******************************************************************************/
static void force_current_rx_dma_length(uint16_t new_length)
{
  uint32_t ctrl;

  ctrl = LDMA->CH[read_channel].CTRL;

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
  uint32_t dest;
  uint16_t already_recvd_cnt;

  // Rewind the DMA destination to discard previously received bytes
  dest = LDMA->CH[read_channel].DST;
  already_recvd_cnt = (((SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN) - 1) - ((ctrl & _LDMA_CH_CTRL_XFERCNT_MASK) >> _LDMA_CH_CTRL_XFERCNT_SHIFT);
  LDMA->CH[read_channel].DST = (dest - already_recvd_cnt);
#endif

  ctrl &= ~_LDMA_CH_CTRL_XFERCNT_MASK;
  ctrl |= ((new_length - 1) << _LDMA_CH_CTRL_XFERCNT_SHIFT) & _LDMA_CH_CTRL_XFERCNT_MASK;

  LDMA->CH[read_channel].CTRL = ctrl;

  LDMA->IEN |= (1 << read_channel);

  LDMA->CHEN |= (1 << read_channel);

  next_rx_buf_tot_len = new_length;
}

/***************************************************************************/ /**
 * Update XferCnt of the current DMA xfer with the length passed as argument.
 *
 * @param new_length Total length of next transfer.
 *
 * @return SL_STATUS_OK if new length successfully applied.
 *         SL_STATUS_FAIL if the DMA already transferred more than requested.
 *         SL_STATUS_ALREADY_EXISTS if the DMA already transferred the requested bytes.
 *         SL_STATUS_NO_MORE_RESOURCE if no more CPC RX buffer is available.
 ******************************************************************************/
static sl_status_t update_current_rx_dma_length(uint16_t new_length)
{
#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlCtsAndRts_D)
  Ecode_t ecode;
  void *buffer_ptr;
  sl_status_t status;

  status = sli_cpc_get_raw_rx_buffer(&buffer_ptr);
  if (status != SL_STATUS_OK) {
    sl_atomic_store(restart_dma, true);
    DMADRV_StopTransfer(write_channel);
    return status;
  }

  sl_atomic_store(restart_dma, false);

  if (new_length <= DMA_MAX_XFER_LEN) {
    rx_descriptor[0u] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), buffer_ptr, new_length);
  } else {
    rx_descriptor[0u] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), buffer_ptr, DMA_MAX_XFER_LEN, 1u);
    rx_descriptor[1u] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), &((uint8_t *)buffer_ptr)[DMA_MAX_XFER_LEN], (new_length - DMA_MAX_XFER_LEN));
    rx_descriptor[0u].xfer.doneIfs = 0u;
    rx_descriptor[1u].xfer.doneIfs = 1u;
  }

  rx_descriptor_head = rx_descriptor;
  next_rx_buf_tot_len = new_length;

  // Start read channel
  ecode = DMADRV_LdmaStartTransfer(read_channel,
                                   &rx_config,
                                   rx_descriptor_head,
                                   rx_dma_complete,
                                   0);
  EFM_ASSERT(ecode == ECODE_OK);
#else
  uint32_t ctrl;
  uint16_t already_recvd_cnt;
  uint16_t remaining;

  // Adjust current dma xfer with new_length
  // Note this proof of concept does not support large buffers (buffer larger than the maximum supported by the LDMA)

  // For safety we momentarily pause the DMA. If we are afraid of suspending
  // it for too long and loosing bytes, we could use a critical section to make
  // sure there are not higher priority interrupt until we resume it.
  DMADRV_PauseTransfer(read_channel);

