espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_drv_secondary_uart_usart.c
  ctrl = LDMA->CH[read_channel].CTRL;
  already_recvd_cnt = (((SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN) - 1) - ((ctrl & _LDMA_CH_CTRL_XFERCNT_MASK) >> _LDMA_CH_CTRL_XFERCNT_SHIFT);

  // For analysis purposes
  if (already_recvd_cnt > already_recvd_cnt_worst) {
    already_recvd_cnt_worst = already_recvd_cnt;
  }

  if (already_recvd_cnt == new_length) {
    DMADRV_ResumeTransfer(read_channel);
    return SL_STATUS_ALREADY_EXISTS;
  }

  if (already_recvd_cnt > new_length) {
    // Here we failed to update current DMA xfer on time.
    DMADRV_ResumeTransfer(read_channel);
    return SL_STATUS_FAIL;
  }

  remaining = new_length - already_recvd_cnt;

  ctrl &= ~_LDMA_CH_CTRL_XFERCNT_MASK;
  ctrl |= ((remaining - 1) << _LDMA_CH_CTRL_XFERCNT_SHIFT) & _LDMA_CH_CTRL_XFERCNT_MASK;

  LDMA->CH[read_channel].CTRL = ctrl;

  DMADRV_ResumeTransfer(read_channel);

  next_rx_buf_tot_len = new_length;
#endif

  return SL_STATUS_OK;
}

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
/***************************************************************************/ /**
 * Update XferCnt of the current DMA xfer with the length passed as argument.
 *
 * @param new_length Total length of next transfer.
 *
 * @return true if new length successfully applied.
 *         false if the DMA already transferred more than requested.
 ******************************************************************************/
static bool update_current_rx_dma_large_payload_length(uint16_t new_length)
{
  LDMA_Descriptor_t *desc;
  LDMA_Descriptor_t *temp_desc;

  // Adjust current dma xfer with new_length
  // For safety we momentarily pause the DMA. If we are afraid of suspending
  // it for too long and loosing bytes, we could use a critical section to make
  // sure there are not higher priority interrupt until we resume it.

  DMADRV_PauseTransfer(read_channel);

  uint32_t *dst_addr;
  uint8_t desc_cnt = 0u;
  uint8_t nb_desc = new_length / DMA_MAX_XFER_LEN;
  desc = rx_descriptor_head;
  temp_desc = rx_descriptor_head;
  dst_addr = (uint32_t *)LDMA->CH[read_channel].DST;

#ifdef _LDMA_CH_CTRL_DONEIFSEN_MASK
  LDMA->CH[read_channel].CTRL &= ~_LDMA_CH_CTRL_DONEIFSEN_MASK;
#else
  LDMA->CH[read_channel].CTRL &= ~_LDMA_CH_CTRL_DONEIEN_MASK;
#endif

  // Check if there enough RX descriptor available
  for (desc_cnt = 0; temp_desc != NULL; desc_cnt++) {
    if (desc_cnt == nb_desc) {
      break;
    }
    temp_desc = (LDMA_Descriptor_t *)(temp_desc->xfer.linkAddr << _LDMA_CH_LINK_LINKADDR_SHIFT);
  }

  if (desc_cnt < nb_desc) {
    DMADRV_ResumeTransfer(read_channel);
    return false;
  }

  desc_cnt = 0u;

  while (desc_cnt < nb_desc) {
    desc->xfer.doneIfs = 0u;
    desc->xfer.xferCnt = (DMA_MAX_XFER_LEN - 1u);

    if (desc_cnt >= 1u) {
      sl_cpc_free_rx_buffer((void *)desc->xfer.dstAddr);
    }

    desc->xfer.dstAddr = ((uint32_t)&dst_addr[(desc_cnt * DMA_MAX_XFER_LEN) / 4u]);
    desc = (LDMA_Descriptor_t *)(desc->xfer.linkAddr << _LDMA_CH_LINK_LINKADDR_SHIFT);
    desc_cnt++;
  }

  if (desc == NULL) {
    DMADRV_ResumeTransfer(read_channel);
    return false;
  }

  sl_cpc_free_rx_buffer((void *)desc->xfer.dstAddr);

  desc->xfer.doneIfs = 1u;
  desc->xfer.xferCnt = (new_length % DMA_MAX_XFER_LEN) - 1u;
  desc->xfer.dstAddr = ((uint32_t)&dst_addr[(desc_cnt * DMA_MAX_XFER_LEN) / 4u]);

  if ((new_length % DMA_MAX_XFER_LEN) != 0u) {
    nb_desc_free = nb_desc + 1u;
  } else {
    nb_desc_free = nb_desc;
  }

  DMADRV_ResumeTransfer(read_channel);

  next_rx_buf_tot_len = new_length;

  return true;
}
#endif

#if (SL_CPC_DRV_UART_FLOW_CONTROL_TYPE == usartHwFlowControlNone_D)
/***************************************************************************/ /**
 * Update dma desccriptor link absolute address.
 *
 * @param current_dma_desc DMA descriptor to update.
 *
 * @param next_dma_desc DMA descriptor to link to.
 ******************************************************************************/
static void update_dma_desc_link_abs(LDMA_Descriptor_t *current_dma_desc,
                                     LDMA_Descriptor_t *next_dma_desc)
{
  uint32_t link = 0;
  uint32_t *current_dma_buffer = (uint32_t *)current_dma_desc;

  link = (uint32_t)next_dma_desc;
  link |= ldmaLinkModeAbs;
  link |= 1 << 1;

  current_dma_buffer[3] = link;
}

/***************************************************************************/ /**
 * Configure and link a new dma desccriptor to another dma descriptor.
 *
 * @param new_dma_desc DMA descriptor to configure and link to.
 *
 * @param buffer Destination buffer for new_dma_desc.
 ******************************************************************************/
static void push_back_new_rx_dma_desc(LDMA_Descriptor_t *new_dma_desc,
                                      void *buffer)
{
  *new_dma_desc = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(&(SL_CPC_DRV_UART_PERIPHERAL->RXDATA), buffer, (SLI_CPC_RX_DATA_MAX_LENGTH < DMA_MAX_XFER_LEN) ? SLI_CPC_RX_DATA_MAX_LENGTH : DMA_MAX_XFER_LEN);
  new_dma_desc->xfer.doneIfs = 1u;

  if (rx_descriptor_tail == NULL) {
    rx_descriptor_head = new_dma_desc;
  } else {
    update_dma_desc_link_abs(rx_descriptor_tail, new_dma_desc);
  }

  rx_descriptor_tail = new_dma_desc;

  if ((LDMA->CHEN & (1 << read_channel)) == 0) {
    return;
  }

  DMADRV_PauseTransfer(read_channel);
  if (LDMA->CH[read_channel].LINK == 0) {
    LDMA->CH[read_channel].LINK = (uint32_t)new_dma_desc | (1 << 1);
  }
  DMADRV_ResumeTransfer(read_channel);
}

/***************************************************************************/ /**
 * Allocate RX buffer and descriptor from ISR.
 ******************************************************************************/
static void rx_buffer_free_from_isr(void)
{
  sl_status_t status;
  void *buffer_ptr = NULL;
  LDMA_Descriptor_t *current_desc = NULL;

  do {
    current_desc = (LDMA_Descriptor_t *)sli_mem_pool_alloc(&mempool_rx_dma_desc);
    if (current_desc == NULL) {
      break;
    }

    status = sli_cpc_get_raw_rx_buffer(&buffer_ptr);
    if (status != SL_STATUS_OK) {
      sli_mem_pool_free(&mempool_rx_dma_desc, (void *)current_desc);
      break;
    }
    push_back_new_rx_dma_desc(current_desc, buffer_ptr);
  } while (true);
}
#endif

/***************************************************************************/ /**
 * Send a reject notification to CPC core.
 *
 * @param reason Reject reason.
 ******************************************************************************/
static void notify_core_error(sl_cpc_reject_reason_t reason)
{
  current_rx_entry->handle->reason = reason;

  // Push rx_entry to pending list
  sli_cpc_push_back_buffer_handle(&rx_pending_list_head, &current_rx_entry->node, current_rx_entry->handle);

  // Notify core
  sli_cpc_drv_notify_rx_data();
}

/***************************************************************************/ /**
 * Stop DMA mode and start receiving bytes in interrupt mode.
 ******************************************************************************/
static void start_re_synch(void)
{
  DMADRV_StopTransfer(read_channel);

  SLI_CPC_DEBUG_TRACE_CORE_DRIVER_PACKET_DROPPED();

  // A header is expected next
  header_expected_next = true;

  sli_cpc_push_back_buffer_handle(&rx_free_list_head, &current_rx_entry->node, current_rx_entry->handle);
  current_rx_entry = NULL;
  USART_IntEnable(SL_CPC_DRV_UART_PERIPHERAL, USART_IF_RXDATAV);
}
